---
type: DuctFittingAndAccessoryPressureDropData
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 7
tags: [revit-api, class]
---

# DuctFittingAndAccessoryPressureDropData

`Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetDuctFittingAndAccessoryData | 2014 | `public DuctFittingAndAccessoryData GetDuctFittingAndAccessoryData ()` |
| Method | GetPresureDropItems | 2014 | `public IList < DuctFittingAndAccessoryPressureDropItem > GetPresureDropItems ()` |
| Method | SetDefaultEntity | 2014 | `public void SetDefaultEntity ( Entity defaultEntity )` |
| Property | CalculationType | 2014 | `public int CalculationType { get ; }` |
| Property | IsCurrentEntityValid | 2017 | `public bool IsCurrentEntityValid { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |